zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf52</name>
  <series>nrf52</series>
  <version>1</version>
  <description>nRF52832 reference description for radio MCU with ARM 32-bit Cortex-M4 Microcontroller </description>
  <licenseText>
Copyright (c) 2010 - 2018, Nordic Semiconductor ASA All rights reserved.\n
\n
Redistribution and use in source and binary forms, with or without\n
modification, are permitted provided that the following conditions are met:\n
\n
1. Redistributions of source code must retain the above copyright notice, this\n
   list of conditions and the following disclaimer.\n
\n
2. Redistributions in binary form must reproduce the above copyright\n
   notice, this list of conditions and the following disclaimer in the\n
   documentation and/or other materials provided with the distribution.\n
\n
3. Neither the name of Nordic Semiconductor ASA nor the names of its\n
   contributors may be used to endorse or promote products derived from this\n
   software without specific prior written permission.\n
\n
THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"\n
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE\n
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE\n
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\n
POSSIBILITY OF SUCH DAMAGE.\n
        </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <cpu>
    <name>CM4</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>1</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
  </cpu>
  <headerSystemFilename>system_nrf52</headerSystemFilename>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <vendorExtensions>
    <ExampleStackSize>2048</ExampleStackSize>
    <ExampleHeapSize>2048</ExampleHeapSize>
    <MaxInterrupts>112</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>FICR</name>
      <description>Factory Information Configuration Registers</description>
      <groupName>FICR</groupName>
      <baseAddress>0x10000000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CODEPAGESIZE</name>
          <description>Code memory page size</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CODEPAGESIZE</name>
              <description>Code memory page size</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CODESIZE</name>
          <description>Code memory size</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CODESIZE</name>
              <description>Code memory size in number of pages</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>DEVICEID[%s]</name>
          <description>Description collection[0]:  Device identifier</description>
          <addressOffset>0x060</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DEVICEID</name>
              <description>64 bit unique device identifier</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <name>ER[%s]</name>
          <description>Description collection[0]:  Encryption Root, word 0</description>
          <addressOffset>0x080</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ER</name>
              <description>Encryption Root, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <name>IR[%s]</name>
          <description>Description collection[0]:  Identity Root, word 0</description>
          <addressOffset>0x090</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>IR</name>
              <description>Identity Root, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICEADDRTYPE</name>
          <description>Device address type</description>
          <addressOffset>0x0A0</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DEVICEADDRTYPE</name>
              <description>Device address type</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Public</name>
                  <description>Public address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Random</name>
                  <description>Random address</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>DEVICEADDR[%s]</name>
          <description>Description collection[0]:  Device address 0</description>
          <addressOffset>0x0A4</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DEVICEADDR</name>
              <description>48 bit device address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00052832</resetValue>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>N52832</name>
                    <description>nRF52832</description>
                    <value>0x52832</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Part Variant, Hardware version and Production configuration</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x41414142</resetValue>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Part Variant, Hardware version and Production configuration, encoded as ASCII</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AAAA</name>
                    <description>AAAA</description>
                    <value>0x41414141</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AAAB</name>
                    <description>AAAB</description>
                    <value>0x41414142</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AABA</name>
                    <description>AABA</description>
                    <value>0x41414241</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AABB</name>
                    <description>AABB</description>
                    <value>0x41414242</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AAB0</name>
                    <description>AAB0</description>
                    <value>0x41414230</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AAE0</name>
                    <description>AAE0</description>
                    <value>0x41414530</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00002000</resetValue>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>QF</name>
                    <description>QFxx - 48-pin QFN</description>
                    <value>0x2000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CH</name>
                    <description>CHxx - 7x8 WLCSP 56 balls</description>
                    <value>0x2001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CI</name>
                    <description>CIxx - 7x8 WLCSP 56 balls</description>
                    <value>0x2002</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CK</name>
                    <description>CKxx - 7x8 WLCSP 56 balls with backside coating for light protection</description>
                    <value>0x2005</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM variant</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000040</resetValue>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K16</name>
                    <description>16 kByte RAM</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K32</name>
                    <description>32 kByte RAM</description>
                    <value>0x20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K64</name>
                    <description>64 kByte RAM</description>
                    <value>0x40</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH</name>
            <description>Flash variant</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000200</resetValue>
            <fields>
              <field>
                <name>FLASH</name>
                <description>Flash variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K128</name>
                    <description>128 kByte FLASH</description>
                    <value>0x80</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K256</name>
                    <description>256 kByte FLASH</description>
                    <value>0x100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K512</name>
                    <description>512 kByte FLASH</description>
                    <value>0x200</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>3</dim>
            <dimIncrement>4</dimIncrement>
            <name>UNUSED0[%s]</name>
            <description>Description collection[0]: Unspecified</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>TEMP</name>
          <description>Registers storing factory TEMP module linearization coefficients</description>
          <addressOffset>0x404</addressOffset>
          <register>
            <name>A0</name>
            <description>Slope definition A0.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000320</resetValue>
            <fields>
              <field>
                <name>A</name>
                <description>A (slope definition) register.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>A1</name>
            <description>Slope definition A1.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000343</resetValue>
            <fields>
              <field>
                <name>A</name>
                <description>A (slope definition) register.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>A2</name>
            <description>Slope definition A2.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x0000035D</resetValue>
            <fields>
              <field>
                <name>A</name>
                <description>A (slope definition) register.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>A3</name>
            <description>Slope definition A3.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000400</resetValue>
            <fields>
              <field>
                <name>A</name>
                <description>A (slope definition) register.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>A4</name>
            <description>Slope definition A4.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000452</resetValue>
            <fields>
              <field>
                <name>A</name>
                <description>A (slope definition) register.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>A5</name>
            <description>Slope definition A5.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0x0000037B</resetValue>
            <fields>
              <field>
                <name>A</name>
                <description>A (slope definition) register.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>B0</name>
            <description>y-intercept B0.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x00003FCC</resetValue>
            <fields>
              <field>
                <name>B</name>
                <description>B (y-intercept)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>B1</name>
            <description>y-intercept B1.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00003F98</resetValue>
            <fields>
              <field>
                <name>B</name>
                <description>B (y-intercept)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>B2</name>
            <description>y-intercept B2.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00003F98</resetValue>
            <fields>
              <field>
                <name>B</name>
                <description>B (y-intercept)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>B3</name>
            <description>y-intercept B3.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000012</resetValue>
            <fields>
              <field>
                <name>B</name>
                <description>B (y-intercept)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>B4</name>
            <description>y-intercept B4.</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0x0000004D</resetValue>
            <fields>
              <field>
                <name>B</name>
                <description>B (y-intercept)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>B5</name>
            <description>y-intercept B5.</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00003E10</resetValue>
            <fields>
              <field>
                <name>B</name>
                <description>B (y-intercept)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>T0</name>
            <description>Segment end T0.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-only</access>
            <resetValue>0x000000E2</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end)register.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>T1</name>
            <description>Segment end T1.</description>
            <addressOffset>0x034</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end)register.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>T2</name>
            <description>Segment end T2.</description>
            <addressOffset>0x038</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000014</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end)register.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
