zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52.svd
        <register>
          <name>CRCINIT</name>
          <description>CRC initial value</description>
          <addressOffset>0x53C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRCINIT</name>
              <description>CRC initial value</description>
              <lsb>0</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UNUSED0</name>
          <description>Unspecified</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TIFS</name>
          <description>Inter Frame Spacing in us</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIFS</name>
              <description>Inter Frame Spacing in us</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSISAMPLE</name>
          <description>RSSI sample</description>
          <addressOffset>0x548</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RSSISAMPLE</name>
              <description>RSSI sample</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>Current radio state</description>
          <addressOffset>0x550</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATE</name>
              <description>Current radio state</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RADIO is in the Disabled state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxRu</name>
                  <description>RADIO is in the RXRU state</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxIdle</name>
                  <description>RADIO is in the RXIDLE state</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rx</name>
                  <description>RADIO is in the RX state</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxDisable</name>
                  <description>RADIO is in the RXDISABLED state</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxRu</name>
                  <description>RADIO is in the TXRU state</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxIdle</name>
                  <description>RADIO is in the TXIDLE state</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tx</name>
                  <description>RADIO is in the TX state</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxDisable</name>
                  <description>RADIO is in the TXDISABLED state</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAWHITEIV</name>
          <description>Data whitening initial value</description>
          <addressOffset>0x554</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>DATAWHITEIV</name>
              <description>Data whitening initial value. Bit 6 is hard-wired to '1', writing '0' to it has no effect, and it will always be read back and used by the device as '1'.</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BCC</name>
          <description>Bit counter compare</description>
          <addressOffset>0x560</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BCC</name>
              <description>Bit counter compare</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>DAB[%s]</name>
          <description>Description collection[0]:  Device address base segment 0</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAB</name>
              <description>Device address base segment 0</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>DAP[%s]</name>
          <description>Description collection[0]:  Device address prefix 0</description>
          <addressOffset>0x620</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAP</name>
              <description>Device address prefix 0</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DACNF</name>
          <description>Device address match configuration</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENA0</name>
              <description>Enable or disable device address matching using device address 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA1</name>
              <description>Enable or disable device address matching using device address 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA2</name>
              <description>Enable or disable device address matching using device address 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA3</name>
              <description>Enable or disable device address matching using device address 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA4</name>
              <description>Enable or disable device address matching using device address 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA5</name>
              <description>Enable or disable device address matching using device address 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA6</name>
              <description>Enable or disable device address matching using device address 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA7</name>
              <description>Enable or disable device address matching using device address 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXADD0</name>
              <description>TxAdd for device address 0</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>TXADD1</name>
              <description>TxAdd for device address 1</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>TXADD2</name>
              <description>TxAdd for device address 2</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>TXADD3</name>
              <description>TxAdd for device address 3</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>TXADD4</name>
              <description>TxAdd for device address 4</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>TXADD5</name>
              <description>TxAdd for device address 5</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>TXADD6</name>
              <description>TxAdd for device address 6</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>TXADD7</name>
              <description>TxAdd for device address 7</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODECNF0</name>
          <description>Radio mode configuration register 0</description>
          <addressOffset>0x650</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>RU</name>
              <description>Radio ramp-up time</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default ramp-up time (tRXEN), compatible with firmware written for nRF51</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Fast</name>
                  <description>Fast ramp-up (tRXEN,FAST), see electrical specification for more information</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTX</name>
              <description>Default TX value</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B1</name>
                  <description>Transmit '1'</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B0</name>
                  <description>Transmit '0'</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Center</name>
                  <description>Transmit center frequency</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER</name>
          <description>Peripheral power control</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral is powered off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral is powered on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
